[
  {
    "id": 1,
    "date": "2025-09-25",
    "title": "Jinx 릴리즈 회고",
    "subtitle": "기술 회고 인척 하는 인생 회고..",
    "tags": ["개발", "프로젝트"],
    "content": "좋은, 그리고 재밌는 경험이었다. 늘 새로운 프로젝트를 시작할 때면 기존보다 어려운 과제에 맞닥뜨리도록 해왔는데, 이번에는 조금 다른 느낌으로 어려웠던 것 같다. \n\n 지금까지의 프로젝트들을 돌아보면, 현실에서의 문제를 해결하기보단, 이미 견고한 시스템과 아키텍처로 동작 중인 무언가를 모방하는 형태의 프로젝트가 더 많았던 것 같다. 하지만 이번엔 내가 실전적으로 공백을 느낀 부분을 메꾸는 작업이었다고 볼 수 있다. 물론 `JPA Buddy` 라던가 하이버네이트 전용 플러그인인 `Atlas`라던가 하는 다른 유사한 프로젝트도 존재하지만, 이번엔 그들을 모방한 프로젝트가 아닌 내가 생각하기에 의미 있을 만한 포인트들을 짚어 그를 바탕으로 구현한데에 차이점이 있다고 생각한다. \n\n 해당 프로젝트를 하면서, 추가적으로 공부한 부분도 많았다. JPA 스펙에 대해 더 자세히 알아야만 했고, 기존 ORM들과 작동방식에서 큰 차이가 나면 혼란을 줄 수 있으니 하이버네이트의 전략에 대해서도 찾아보았다.(하이버네이트 유저 가이드를 참고 했지만, 당연히 완독은 못했음) 데이터베이스 내부 구조에 대한 논문과, DDIA를 읽어보며 내가 만든 툴에 대한 한계점도 가늠해 볼 수 있었다. \n\n ### 내가 해당 프로젝트를 정말 OSS로 키우고 싶은가? \n\n 이 부분에 대해서는 더 생각해보아야 할 것같다. 우선은 블로그에도 다 적진 못했지만 부족한 점을 잘 알고 있다. 컴파일 시 자동으로 스냅샷을 감지하기 때문에, 그 이전 스냅샷이 데이터베이스에 정말 적용되어있는 지는 알 수 없음. 이 부분에 대해 마치 `git`처럼 `HEAD`와 같은 마킹을 통해(jinx에서 사용할 테이블을 별도로 만든다) 감지하도록 구현해두긴 했지만, 그 부분에 대한 구멍이 많음. 어제 추가적으로 `record` 타입에 대한 지원도 추가했지만 앞으로 달라지거나 변경되는 모든 JPA 스펙을 이해한 후 구현하기란 쉽지 않을 듯 하다. 모든 데이터베이스 방언에 대해서도 추가적으로 공부하고, JPA별, DB방언별, 빌드 툴이나 IDE별 버전 관리를 해가며 유지보수를 해야만한다. _이걸 나 혼자 할 수 있을까?_ \n\n 당장은 기능 스코프를 늘리기 보다, 기존 기능에 대한 검증에 집중해볼 생각이다. 우선은 내가 써볼 생각임... 실제로 내가 쓰려고 만든 툴이기도 함. \n\n 이걸 또 만들면서 느낀게, **내가 스스로에 대한 기준점이 과하게 높나?** 하는 생각이었다. 내가 주로 생각하거나, 가지고 있는 일종의 철학적 신념에서 가장 크게 배울 수 있던 점은 *스스로가 특별한 사람이 아니라*는 자각이다. 이는 물론 나뿐 아니라 다른 사람들에게도 적용되는 말이지만, 이 우주에 답은 없고 사람들이 정답처럼 여기는 무언가도 사실은 답일 수가 없다는 것이다. **진리**에 많은 사람들이 목말라 있지만 이에 도달하기는 당연히 어려운고로, 늘 사람들이 정답을 찾아 헤매인다고 생각한다. 나도 그렇다. 내가 나의 프로젝트를 일종의 정답지 처럼 여기지 않는 마음이나, 내가 작성한 코드의 유효성을 배제하고서라도 이게 정답일리가 없다고 생각한다. 이는 비단 우주의 정답이 아닐뿐더러 실존적으로 모든 상황과 맥락에서 맞아떨어지는 구조나 코드란 있을 수 없는 일이기 때문이다. 어쩌면 모든 것들은 회색지대이자 스펙트럼이라고 생각한다. 어느 시점에는 이게 맞을수도 있고 다른 시간축에선 충분히 틀렸다고도 말할 수 있는 것이다. 내가 고려를 했었느냐, 생각지도 못했었냐가 더 중요할 듯? 그럼 내가 고려할 수 있는 것은 인간으로서 감각할 수 있는 시간에 대해서만 고려하는게 최선이다. 이는 AI나 다른 개발자들이 와서 도움을 준다고 하더라도, **현재**의 입장에서는 맞는 말일 순 있지만 시간이 지나면 또 모를 일이 되기도 한다. 당연한거임 어쩌면.. \n\n 그렇다보니, 스스로에 대한 확신을 얻기가 어렵다는 단점이 있다. 완벽함이 불가능함을 알기에 없는 고지를 향해 끝없이 오르는 느낌은 아니고, 걍 망망대해를 떠돌고 어디쯤이 괜찮을 지 찾는 기분정도. 누군가 내게 칭찬을 하더라도 *정말 맞나?*하는 의심, 부족한 점을 꼬집는다면.. 해당 입장에선 당연히 나올 수 있는 말이라고도 생각한다. 일상에서 이런 내 생각을 구구절절 말할 수는 없으니 종종 내가 너무 수동적 입장을 취한다는 오해도 받긴 하지만.. 위와 같은 생각을 기반으로 한다는 것이 일단 원천적 생각이다. \n\n **이러한 내 사고과정이 내게 주는 장점은 뭘까?** \n\n 장담하건대, 딱히 없다. ㅋㅋㅋㅋ 현대 사회에서 개인에게 요구하는 회복탄력성이나 자존감.. 이러한 지점들로 하여금 개인을 성장시키고, 스스로를 발전시키는데에 사용하겠지만, 개인적으로 그러한 개념들이 개인의 단기적 행복에는 도움이 될 수 있을거라 생각하지만 근본적인 해답이 될 수는 없다고도 생각한다.. 이 세상의 구조와 부조리에서 *위안*으로 도망치는 느낌이랄까.. 그렇다고 내가 니체의 초인이나 시지프같은 인물이 되고 싶은건 아님.. 다만 걍 부조리의 인식을 통해 그런 식으로 생각하는게 어려워졌다.. 라고 하는게 가까운 말일 것이다. 그나마 뽑자면 가끔 생각이 깊다고 봐주는 사람도 있긴 한 것? \n\n 사실 이런 주제로 토론하거나 이야기 나누길 정말 좋아하지만, 그럴 대상이 없는 관계로, (만약 있더라도 어디서부터 어디까지 말해야할지 모르겠음) 블로그에 정식적으로 적기엔 또 너무 개인적이라 어딘가에 박아둘 이 아카이브에 털어놓기로 결심했다..ㅎㅎ \n\n 아무튼 다시 돌아와서, 인간은 시간과 공간이라는 물리적 한계, 이를 확장하자면 환경이나 입지..가 있기에 내가 이 프로젝트를 얼마나 오래 유지보수하고 관심을 쏟을지는 모르는 일이다. 그래서 개인적으로 확신에 찬 말을 하길 꺼리는 편이기도 함. 차치하고, 정확히 말할 수 있는 건, 지금은 잘 갈무리해보고 싶다는 마음이 강하다는 것이다. 앞으로 추가적으로 검토해볼 사항은 다음과 같다.\n\n ## 로드맵\n\n 1. 리네임 매칭 알고리즘(해시+버킷+타이브레이커)으로 빅오표기법 O(n^2)에서 O(n)정도 줄였지만, 아주 여러개의 엔티티 환경에서의 실질적 성능 발전이 얼마만큼 이루어졌는지 jmh로 확인해보기.\n\n 2. 점진적 마이그레이션 방법에 대한 구체화 및 구현\n\n 3. git like 커밋 시스템 안정화\n\n 이 정도를 우선해보고.. 가장 중요한건 검증일듯? 솔직히 나같이 사회적 쉐임이 높은 인간들한텐, 검증에 대한 안심이 가장 중요하긴 하다. 더 구체적 사항으로는, 조금 더 클린하고 유지보수가 쉬운 코드로 점진적 리팩토링이다. 최근에는 DDD와 헥사고날에 대한 강의를 수강중인데, 여기에서 지금까지 디테일하게 적용해보지 못했던 지점들에 대해서 짚어준다. 클린코드와 자바 이펙티브를 읽은지 거의 2년이 되어가는데, 돌아보면 그땐 제대로 이해도 못한 듯? 그래서 지금 시점에서 다시 한번 빠르게 검토하고, 적용해볼 수 있는 지점에 대해선 다시 고민해볼 생각이다."
  },
  {
    "id": 2,
    "date": "2025-10-10",
    "title": "2025 연말 잡설",
    "subtitle": "계획 아니고 늘 있는 스스로와의 wwe",
    "tags": ["잡담"],
    "content": "최근엔 지금까지 했던 프로젝트 결과물들의 문서화를 위주로 진행했다. 솔직히 다시보니, 내가 생각보다 잘 만든 부분도 있고, 그렇지 못한 부분도 있긴 했음. 과거 나의 의도를 파악하는데에도 어느정도 시간이 들긴 했다. 그래서 평소에 미리미리 문서화를 진행했어야 하는건가 싶기도 했음. 문서화를 하면서 생각이 든건, 진짜 존나 많이 했구나.. 였음. 모듈 하나씩만 짚어도 말할 게 너무 많아져서 개발을 오히려 멈추고 지금까지의 것을 더 정확하게 소화하고 손에 잘 쥐고 있을 수 있게 조치하는 게 우선일 것 같다는 생각도 들었다. 물론 그것과 별개로 이론에 대한 지식은 더 필요로 하는 것 같다. jinx 릴리즈 이후로는 몇달동안 개발에만 몰두해있어서 그런지 도저히 다른 코드나 프로젝트, 책에 손이 안가긴 했다. 완전한 털어냄이 아니고 몇 일 기다리다보면 회복될만한 상태임을 알고 있어서 그냥 쉬었음. 명절도 껴있는 일정이었는데 그 기간엔 아르바이트 하면서 시간을 보냈다. 미뤄뒀던 애니들도 정주행을 다했고, 좋아하는 영화는 영화관런을 3번이나 했음. 남은 연휴까지 사실 약속이 더 잡혀있는데, 차주부턴 다시 가다듬고 공부를 시작해야 할 듯?\n\n 우선은 다시 **알고리즘**을 해야한다. 이것도 범위와 강도에 있어서 늘 고민이지만 골하위랜디가 가능할 수준만 우선은 상정해봐야겠음. 그 이상을 섣불리 삼으면 흥미가 떨어질 것 같다. 마저 읽어볼 책은, *《JVM 밑바닥까지 파헤치기》*랑 *《Crafting Interpreters》*가 우선시 될 것 같다. 앞서 헥사고날 아키텍처 관련 강의도 30퍼센트정도 더 남아서 그것도 마무리 해야함. 추가적으론 《자바 이펙티브》랑 《리팩토링 2판》을 추가적으로 읽고 싶긴함. 인터프리터랑 jvm 책은 어차피 단숨에 읽기 어려울테니, 강의먼저 수강하고 읽어봤던 자바 이펙티브 및 리팩토링 책을 일주일안에 읽기를 목표로 두고 있긴함. 앵간 안돼도 상관없긴 합니다. 저것들까지 전부 마무리되면 컴파일러 쪽, 하나 더 공부해서 자체 DSL만들기에 도전해보지 않을까? 25년안에 할 수 있을지 모르겠음. 사실 프로젝트 더 늘려봤자 큰 효용은 없을 것 같지만 기존 목표로 뒀던 것이기 때문에 걍 진행하려고 한다. 딱 이것까지만?? 그리고 오늘 급작스럽게 Godot 으로 텍스트기반 로그라이크 게임을 하나 만들어볼까 했는데, 예전에 브런치에 써뒀던 니체 초인에 대한 에세이를 바탕으로 작성해볼까 했음. 인간의 자유의지의 한계와 부조리를 직면하고도 그대로 살아갈 수 있을지에 대한 ㅇㅇ. 근데 스크립트를 오글거려서 못쓰겠음.. 그리고 철학적 레퍼런스도 조금 더 메타포로 가져오고 싶으면 공부 좀 더 해야할 듯? 이건 여유 좀 두고 정말 취미로 만들어서 지인들한테만 공개해봐야겠다. \n\n 사실 더 하고 싶은건 많긴함. 데이터베이스 내부 구현 쪽 보면서 Git 같은 버전관리.. VCS 시스템 모방해봐도 재밌을것 같고, JVM 공부하고 똑바로 이해했으면 커스텀 프로파일러도 해볼만하지 않을까? 근데 여력도 없고 무리해봤자 지쳐서 관둘까봐 시작을 안하는 거긴 하다. 사실 계획도 촘촘히 세울수록 못 지키는 편이라 아주 루즈하게 기획하는 편이기도 하다. 가끔 다른데에 눈돌아가도 관성적으로 돌아올 것이란걸 난 예측할 수 있지만 타자들은 종종 내가 영영 길을 잃을까 만류하기도 하는 거 같음. 취업에 대한 요구도 있긴하지만 사실 원하는대로 공부하고 만들고 하는 현재 생활이 만족스럽긴해서 좀 안일하게 있는건 팩트기도 하다. 당연히 잘될거 같아서 이러는건 아니고 나만있는 운동장에서 놀고 있는데 이게 현실로 끄집어져서 평가받는 기분이랄까.. 그래도 최소한의 사회적 *생산*을 위해서라면 필요한 과정이라는 데에 동의는 한다. 내가 원하는 방향이 정확히 어떤걸까? \n\n 개발을 장난이나 감으로 하고 싶진 않다는 건 맞긴 함. 재미도 있고 충분히 도전적인 요소도 많고 현재가 모자란 만큼 성장할 여지도 있는 것이겠지. 다만 이걸로 내가 이 세상에 어떤 생산을 낳을 것이냐고 생각하면 정확히 생각나는 게 없긴 하는 것 같다. 내가 지금하는 작업이나 공부는 순수하게 나만을 위한 작업인 것 같다. 순수하게 탐구 원툴. 비단 개발뿐만 아니라 내가 꽂히는 철학적 사조나 책이나 사상가. 하물며 애니나 게임에도 몰두하듯 그냥 몰두하는 것 그 자체가 나의 목적인 것 같기도 함. 예전에 팀프로젝트나 이런걸 했을 때엔 그래도 타인과의 템포, 진도, 범위를 맞추어 갔지만 지금은 솔직히 내가 봐도 과한 점이 있긴하다. 혼자 하는 작업이 그래서 더 편안하고 좋은건 맞지만 현실과의 괴리감이 발생하기 쉬운 것 같기도 하다. 언제까지고 이렇게만 살 수는 없으니 세상에 무언갈 던져도 보고 소통을 하려고 해야하긴 할 듯. 이대로 시간이 너무 많이 흘러버린다면 골방에서 혼잣말하는 괴인이 되어있을지도 모른다는 두려움이 내심있기도 하다. 그리고 내가 작성한 블로그 글들이나, 공식문서들을 가까운 지인들에게 종종 보여주기도 하는데(꼭 기술적인거 아니어도) 너무 어렵게, 그래서 조금은 무섭게 느껴진다는 피드백을 듣기도 했다. 사실 그런 위화감을 조장하고 싶은 마음도 생각도 없지만, -진심으로 나는 나도 줫도 없다고 생각하기 때문에..- 내가 너무 잘 소화시킨 지식들에 대해서는 너무 당연히 타인도 알고 있을 것이라 가정하고 말하거나 쓰는 버릇이 있는 것 같긴하다. 이 부분에 대해선 어떻게 하는게 좋을 지 조금 더 고민해봐야 할듯? 글의 목적에 따라 좀 조정할 필요는 있을 것 같다. 그리고 타인의 괜한 피상적이고 표상적인 잔소리를 듣기를 싫어해서.. 왜냐하면 웬만하면 인지하고 있지만 지금 당장 해결할 의지가 없어서, 혹은 조금 더 시간이 필요한 문제라서, 아니면 알더라도 그럴 생각이 없어서.. 등등의 이유가 있음. 아무튼 그래서 타인과의 소통이나 스몰토크가 개인적 영역의 화두로 넘어가는걸 즐기진 않음. 그러면 타자와 진실된 소통이 어렵죠 당연히? ㅋㅋ\n\n 아무튼 이게 내 솔직한 마음이긴 하다. 너무 잡소리로 빠졌는데. 하반기엔 이런 소프트웨어적인 문제점에서도 인지하고 있는만큼, 개선해보려고 노력해야겠다. 사실 특정한 목적을 가지고 만나는 인간관계는 분위기 해치지 않고 *친절하고 상냥한* 이미지를 가진다고 생각하지만 이조차도 내 착각일 수 있긴 함. 적어도 노력은 하긴 함. 어디가서 심리학이나 인간관계술, 수사학에 대한 책이라도 읽어야 하나😂\n\n"
  }
]
